// #Область ОбработчикиСобытийФормы

// #Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИмяКонстанты = Параметры.ИмяКонстанты;
	Обработка = РеквизитФормыВЗначение("Объект");
	Данные = Обработка.ДанныеКонстанты(ИмяКонстанты);
	
	Если Не Данные.Доступно Тогда
		Отказ = Истина;
		
		Возврат;
	КонецЕсли;
	
	Заголовок = Данные.Заголовок;
	Реквизиты = Новый Массив;
	Реквизиты.Добавить(Новый РеквизитФормы("ЗначениеКонстанты", Данные.Тип));
	ИзменитьРеквизиты(Реквизиты);
	ЭтаФорма["ЗначениеКонстанты"] = Данные.Значение;
	ПолеЗначения = Элементы.Добавить("ПолеЗначения", Тип("ПолеФормы"));
	ПолеЗначения.Вид = ВидПоляФормы.ПолеВвода;
	ПолеЗначения.ПутьКДанным = "ЗначениеКонстанты";
	ПолеЗначения.Заголовок = НСтр("ru='Значение'");
	ПолеЗначения.КнопкаОчистки = Истина;
	ПолеЗначения.Ширина = 60;
	ПолеЗначения.МногострочныйРежим = Данные.Тип.СодержитТип(Тип("Строка"));
	
КонецПроцедуры

// #КонецОбласти

// #КонецОбласти

// #Область ОбработчикиКомандФормы

// #Область СобытияФормы

&НаКлиенте
Процедура Записать(Команда)
	
	Попытка
		ЗаписатьНаСервере();
		Оповестить("КонстантаИзменена", ИмяКонстанты, ЭтаФорма);
		Закрыть();
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

// #КонецОбласти

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

// #Область СобытияФормы

&НаСервере
Процедура ЗаписатьНаСервере()
	
	Обработка = РеквизитФормыВЗначение("Объект");
	Обработка.ЗаписатьЗначениеКонстанты(ИмяКонстанты, ЭтаФорма["ЗначениеКонстанты"]);
	
КонецПроцедуры

// #КонецОбласти

// #КонецОбласти
